[
  {"term": "Ace", "definition": "A serve that lands in the opponent's court without being touched."},
  {"term": "Angle Attack", "definition": "A spike directed diagonally across the court."},
  {"term": "Approach", "definition": "The steps a hitter takes before jumping for an attack."},
  {"term": "Back Row Attack", "definition": "An attack made from behind the 3-meter line."},
  {"term": "Back Row Defense", "definition": "Defensive positioning and play from the back row."},
  {"term": "Back-row Setter", "definition": "A setter positioned in the back row who can set or attack legally."},
  {"term": "Ball Control", "definition": "The skill of controlling the ball during passes, sets, and attacks."},
  {"term": "Block", "definition": "A defensive play at the net to stop or deflect an attack."},
  {"term": "Block Assist", "definition": "When multiple players help to successfully block an attack."},
  {"term": "Block Coverage", "definition": "Positioning teammates to recover balls after a block attempt."},
  {"term": "Block Out", "definition": "A block that deflects the ball out of bounds off the opponent’s attack."},
  {"term": "Block Penetration", "definition": "Extending hands over the net to effectively block an attack."},
  {"term": "Blocker", "definition": "A player attempting to stop or redirect an opponent’s attack at the net."},
  {"term": "Bomb", "definition": "A powerful spike aimed at scoring a point."},
  {"term": "Bounce Serve", "definition": "A serve that hits the floor once before reaching the opponent."},
  {"term": "Call", "definition": "Communication among players regarding ball direction or play strategy."},
  {"term": "Catch", "definition": "Illegal handling of the ball where it is momentarily held."},
  {"term": "Center Blocker", "definition": "Middle player specializing in blocking attacks at the net."},
  {"term": "Center Set", "definition": "A set delivered to the middle hitter."},
  {"term": "Ceiling Serve", "definition": "A serve that hits the ceiling and lands in play on the opponent’s side."},
  {"term": "Chase", "definition": "Moving quickly to reach a ball that is difficult to reach."},
  {"term": "Close Block", "definition": "A block where hands are moved together to cover more area."},
  {"term": "Coverage", "definition": "Positioning to recover balls deflected off a teammate’s attack or block."},
  {"term": "Cross-court", "definition": "A ball hit diagonally across the court from the hitter’s position."},
  {"term": "Cross-court Pass", "definition": "A pass delivered diagonally across the court to a teammate."},
  {"term": "Deep Defense", "definition": "Defending balls near the back boundary line."},
  {"term": "Deep Serve", "definition": "A serve aimed near the opponent’s backline."},
  {"term": "Defensive Specialist", "definition": "Player specialized in defensive skills, usually back row."},
  {"term": "Defense", "definition": "All actions intended to prevent the opponent from scoring."},
  {"term": "Dig", "definition": "A defensive move to prevent the ball from hitting the floor."},
  {"term": "Double Block", "definition": "Two front-row players attempting to block an attack together."},
  {"term": "Double Hit", "definition": "When a player contacts the ball twice consecutively, usually considered a fault."},
  {"term": "Dump", "definition": "A setter’s deceptive attack, where they tip or push the ball over the net."},
  {"term": "Dump Attack", "definition": "A surprise attack by the setter instead of a set."},
  {"term": "Extended Block", "definition": "Blocking where arms fully extend over the net to intercept the ball."},
  {"term": "Face-up Pass", "definition": "A pass made while facing the net directly."},
  {"term": "Fake Spike", "definition": "Deceptive movement pretending to attack but not hitting."},
  {"term": "Fast Set", "definition": "A quick set designed to surprise blockers."},
  {"term": "Feint", "definition": "A deceptive action to trick opponents, often in attacking."},
  {"term": "Fielding", "definition": "Defensive play to recover balls and keep them in play."},
  {"term": "Floater Serve", "definition": "A serve with no spin, causing erratic movement in the air."},
  {"term": "Floating Ball", "definition": "Ball moving unpredictably due to lack of spin."},
  {"term": "Foot Fault", "definition": "Stepping over the service line while serving."},
  {"term": "Footwork", "definition": "The movement and positioning of the feet during play."},
  {"term": "Front-row Attack", "definition": "Attack made by a player positioned in the front row."},
  {"term": "Front-row Setter", "definition": "Setter positioned in the front row who can attack legally."},
  {"term": "Full Coverage", "definition": "Complete defensive positioning behind blockers to recover deflected balls."},
  {"term": "Gap Attack", "definition": "Attack aimed at open spaces between blockers."},
  {"term": "Game Point", "definition": "A point that will win the game if scored."},
  {"term": "Goal Line Defense", "definition": "Defensive play aimed at protecting the back boundary line."},
  {"term": "Hand Setting", "definition": "Proper technique of setting the ball using fingers."},
  {"term": "Hitting Percentage", "definition": "A statistic measuring attack efficiency: (kills - errors) ÷ attempts."},
  {"term": "Hot Zone", "definition": "Area of the court where attacks are concentrated."},
  {"term": "Hybrid Block", "definition": "Combination of single and double block strategies."},
  {"term": "Inside Attack", "definition": "Attack directed toward the middle of the opponent’s court."},
  {"term": "Inside Hitter", "definition": "Middle front-row attacker."},
  {"term": "Jump Float Serve", "definition": "A serve combining a jump and no spin for unpredictable motion."},
  {"term": "Jump Set", "definition": "A set performed while the setter jumps to reach higher."},
  {"term": "Jump Serve", "definition": "A serve where the player jumps before hitting the ball."},
  {"term": "Junk Defense", "definition": "Improvised or unexpected defensive positioning."},
  {"term": "Key Position", "definition": "Critical area on the court, often near the net or attack zones."},
  {"term": "Late Set", "definition": "A set delivered slightly later than normal, disrupting timing."},
  {"term": "Line Block", "definition": "A block aimed to stop a ball going along the sideline."},
  {"term": "Line Shot", "definition": "A spike directed along the sideline."},
  {"term": "Line-up", "definition": "Arrangement of players for service or rotation."},
  {"term": "Libero", "definition": "Specialized defensive player who can replace any back-row player."},
  {"term": "Libero Replacement", "definition": "A substitution allowing the libero to enter the back row without formal rotation."},
  {"term": "Long Serve", "definition": "A serve aimed deep into the opponent’s court."},
  {"term": "Loose Ball", "definition": "A ball not under control by any player."},
  {"term": "Middle Attack", "definition": "Attack made by a middle hitter close to the net."},
  {"term": "Middle Block", "definition": "A block executed by the middle front-row player."},
  {"term": "Middle Hitter", "definition": "Player positioned in the middle front row who attacks and blocks."},
  {"term": "Mis-hit", "definition": "Unintended or poorly executed strike of the ball."},
  {"term": "Net Violation", "definition": "Touching the net or crossing it illegally during play."},
  {"term": "Off-speed Attack", "definition": "A slower attack intended to disrupt timing of blockers."},
  {"term": "Overhand Pass", "definition": "A pass using hands above the head, usually a set."},
  {"term": "Overhand Serve", "definition": "A serve performed with an overhead motion, often with spin."},
  {"term": "Overpass", "definition": "A ball accidentally passed over the net by a teammate."},
  {"term": "Out-of-system Set", "definition": "A set made when the offense is not in its ideal formation."},
  {"term": "Outside Attack", "definition": "Attack executed by the left-side hitter."},
  {"term": "Outside Hitter", "definition": "Primary attacker hitting from the left side of the court."},
  {"term": "Overpass Attack", "definition": "An attack resulting from the opponent’s overpass."},
  {"term": "Power Set", "definition": "A high, fast set to maximize the hitter’s attack power."},
  {"term": "Quick Attack", "definition": "Fast attack immediately after the set to surprise blockers."},
  {"term": "Quick Set", "definition": "Set delivered with minimal time between pass and attack."},
  {"term": "Recover", "definition": "Regaining position or control after a play."},
  {"term": "Red Zone", "definition": "Critical area near the net where attacks are most frequent."},
  {"term": "Rotation", "definition": "The movement of players clockwise after a side-out."},
  {"term": "Rotation Error", "definition": "Fault due to incorrect positioning during rotation."},
  {"term": "Service Ace", "definition": "A serve that directly results in a point without being touched by the opponent."},
  {"term": "Service Error", "definition": "Fault occurring during serving, like hitting out of bounds."},
  {"term": "Service Reception", "definition": "Receiving the opponent’s serve and controlling it for the offense."},
  {"term": "Service Rotation", "definition": "The order of serving and player positions in rotation."},
  {"term": "Set Distribution", "definition": "Allocation of sets among attackers."},
  {"term": "Set Point", "definition": "A point that will win the current set if scored."},
  {"term": "Set Tempo", "definition": "Speed and timing of the set."},
  {"term": "Set Variation", "definition": "Using different types of sets to confuse the defense."},
  {"term": "Shot Block", "definition": "Block aimed at intercepting a spike."},
  {"term": "Short Serve", "definition": "Serve that lands near the net or short in the opponent’s court."},
  {"term": "Side Arm Serve", "definition": "Serve performed with a sidearm motion."},
  {"term": "Side-out", "definition": "Winning the serve from the opponent."},
  {"term": "Signal", "definition": "Non-verbal cue given by setter or team to indicate play."},
  {"term": "Simultaneous Block", "definition": "Two or more blockers jumping at the same time to block an attack."},
  {"term": "Soft Attack", "definition": "Attack using a tip or lightly hitting the ball to place it."},
  {"term": "Speed Set", "definition": "A set delivered quickly to reduce reaction time for blockers."},
  {"term": "Spin Serve", "definition": "A serve with spin to make it curve unpredictably."},
  {"term": "Stack Formation", "definition": "Formation where attackers line up for coordinated attacks."},
  {"term": "Steal", "definition": "Intercepting a ball from the opponent’s attack or serve."},
  {"term": "Strong Side Attack", "definition": "Attack executed from the dominant hitting side."},
  {"term": "Swing Block", "definition": "A blocking technique where hands swing to intercept a ball."},
  {"term": "Swing Set", "definition": "Setter moves arms in a swinging motion to deliver the set."},
  {"term": "Tip Shot", "definition": "A light attack over or around blockers."},
  {"term": "Transition Defense", "definition": "Defensive positioning after losing the ball."},
  {"term": "Transition Offense", "definition": "Offensive play immediately after winning a defensive ball."},
  {"term": "Transition Play", "definition": "Shifting from defense to offense during play."},
  {"term": "Two-on-one Block", "definition": "Two blockers working against one attacker."},
  {"term": "Weak-side Attack", "definition": "Attack made from the non-dominant side of the court."},
  {"term": "Weak-side Block", "definition": "Blocking on the non-dominant attack side."},
  {"term": "Winning Attack", "definition": "An attack that directly results in a point."},
  {"term": "Winning Percentage", "definition": "The ratio of matches won to total matches played."},
  {"term": "Wipe", "definition": "Hitting the ball off a blocker’s hands so it goes out of bounds."},
  {"term": "Volley", "definition": "Continuous back-and-forth play of the ball over the net."},
  {"term": "Zone Defense", "definition": "Defensive strategy where players cover designated areas of the court."}
]
